using System;

namespace Input13
{
    class Program
    {
        static void Main(string[] args)
        {
            Console.WriteLine("Составить программу вывода на экран следующей информации:2 кг13 17");
            Console.WriteLine("2 кг");
            Console.WriteLine("13 17");
        }
    }
}