using System;

namespace Input7
{
    class Program
    {
        static void Main(string[] args)
        {
            Console.WriteLine("Составить программу вывода на экран в одну строку трех любых чисел с двумя пробелами между ними.");
            Console.WriteLine("4 " + " 5 " + " 6");
        }
    }
}