using System;

namespace Input12
{
    class Program
    {
        static void Main(string[] args)
        {
            Console.WriteLine("Составить программу вывода на экран следующей информации:5 107 см");
            Console.WriteLine("5 " + "10");
            Console.WriteLine("7 см");
        }
    }
}