using System;

namespace Input11
{
    class Program
    {
        static void Main (string[] args)
        {
            Console.WriteLine("Составить программу вывода на экран «столбиком» четырех любых чисел.");
            Console.WriteLine("10");
            Console.WriteLine("20");
            Console.WriteLine("30");
            Console.WriteLine("40");
        }
    }
}