using System;

namespace Input8
{
    class Program
    {
        static void Main(string[] args)
        {
            Console.WriteLine("Составить программу вывода на экран в одну строку четырех любых чисел  с одним пробелом между ними.");
            Console.WriteLine("1 " + "2 " + "3 " + "4 ");
        }
    }
}